{"tx_hash": "EbJpWpR2e734mNBoyGER438eHB5hid4bp9u4rSqtfFdh", "action_id_social": "EwqYC5FTKMi72vzGK1R1ZNrm79kNDp2Ei2BTVpNUgpyx-0-widget", "block_id": 85756379, "block_timestamp": "2023-02-22 00:54:24.469", "signer_id": "michaelpeter.near", "widget_name": "TosContentDraft", "source_code": "const tos = `\n# alpha.near.org terms of service\n\n## Clarum docto extra det sub nova\n\nLorem markdownum expendite luminibus tenent quoque, sustinet iuxta, et revocare\nne potes, Theseus nulla volutant erunt plus. Loqui regna et deum Iuventae quas,\nconsulit adsiduis invenit in origine referat inhaesi Typhoea desine, Herculis\nEnipeus. Pentheus ipse officium clamat saturatos concessa, in fretum eo\nconiunctaque si femina et Iapetionides fugiat furit nebulas. Se et nunc paterer\npaelicis et totum reflectitur facta protinus salignis fortibus prius Lacon\nmortisque, variarum? Montibus inmoritur meruere laquei, generis Athamanas\nnympham tantaque, amoris caeruleum prohibete inhospita curruque legit; *tactus*\nuna primis.\n\n## Fuerat sit et fatetur innixamque hoc\n\nAccepisse lascivaque ausa tempora urna non corpore facta aequora nostrae. Par\nlecto solutus gaeminis tacta: est annum, pudorem nititur teste caput Baccho;\nvellet inscripta probat ualtima. Caicus et atempora aliter quondam lacertis fato\nexit sequentur **illo**; Iovi Phoeabus quaea Sabaea verba summo suus. Regia\ninvadunt circuiere sequenti remos in geri aliamve, quies quae dixi maanu Musa\ninpune, huc temptamenta vir. Adahuc in gramen parari columnae et esse, sed tamen\nprima Apolline, ad acuta tantum.\n\n    var pageGrepAdd = cmykCompatible;\n    if (enterpriseServerSprite(cms)) {\n        key_error = pcmcia;\n        led_vaporware.filePathWeb(utf, shareware);\n    }\n    piracyDual(recordPointLink, blu_console, 18 * partition);\n\n## Adhuc ergo sub rettulit mihi lacrimisque refugam\n\nTamen [in retentus cum](http://www.quem-cognoscere.org/) faciem Aeneae parabat\nnumero metuit **priorum quotiensque** canos? Serpentis mox esse sua leporem\nPhoebi culpa utroque, me supra tantorum o?\n\nDuratos dextroque, in Haec deprendere vixque? Omne signum humi iactata; signatum\ncorneus credens!\n\n## Praecluserat ossa consulat iussa\n\nOthryn ruit nervis utile. Se tam totumque, Lelegas et vulnus **vetustas**\nmatresque deae lambit me. Flores inruampere optes silvisque sumptoque modo totam;\net sparso proxima poenaeque et amor *tantum occupet caelatus* honores.\nCircumstant Iuppiter fera domitae corpore viderat suco aperire primum occubuisse\ntectus. Qua solent litus, nec vina ut plagas illis honoris, ante querenda non\nSiculique.\n\nMaiora esse puppes pendere, hoc decoro eripiunt hostisque perire movet, quanto.\nVolucris monstris reponit et ante ora, fuit, et!\n\n## Recenti honorem brevis\n\nLorem markdownum pleno, flavescere altas ut obscenis et solvit aspicit. **Pennis\nales** domos mente, in ait foeda comitum, septimus vite Pyrois pennae cernam\n**in mensis patrem**, in.\n\n## Germanamque dulci ipsos\n\nHuic iam mea fregit vetus potentia repono regna mirabile insidias herba et terra\niactatis nullos vulnere; aras. Graditur surgere obstipuit oras in et ratione!\n\n> Solem redimebat possederat numen me dabat deceptaque relictis fecit leges\n> Marte suae adest dignus vultu, numen pacatum. Consistere adventum illuc, et\n> urbes temptanda esse coeunt longa cognoscite lactisque quod! Enim signa animis\n> et exarsit virgo, in vacet fecundaque sanguine blanditiis obortis; et erat\n> intercipe silva. Consurgere haec iuppiter suos. Surgit nata fetus cacumine:\n> auras cum: alieni nec magno quondam.\n\n## Padumque sanguine quoniam tridentigero avidos\n\nPortans sua *hunc* fraxineam quod cacumina ne dumque intertextos, procul et\nextento membra utero; quam. Murice *secuta succedere ad* nympha *necis* linoque\nsic.\n\n    flash_gate_mbr = 380198 + -2;\n    var pharming_bank = flat;\n    emoticon.firmware_zebibyte.uat_disk(javaDesign + passwordBitWebsite,\n            dragControl(media(3, -4, classBridgeDefragment),\n            horizontal_isdn_pad, osiBit));\n    cleanMonochromeLock = netbios(5, -5);\n    windows.graphic_dbms -= power_file_rom(fileCoreSoftware + boot_clock_dimm *\n            thunderbolt, irc(real));\n\n## Aevo clamatque et pulchra omnes\n\nOlivae parantem portante obstrepuere quod oblita lingua. Aequora resupinum\ninquit aliena, lacertos, das et moriorque rabies, cum lacrimante **tuque** me\nnemo. Castrorum et Iunonis olor, nisi pedum Aiacis,\n[Bacchus](http://manetvera.io/edidit.aspx); est. Solo arma deprendimur\nreversurum volucris tyranni ortus.\n\n## Maesto effugit sed femina paterno hinc cupidine\n\nEst memor duce; scitatur sic inmeritae cum faciat facta, dixit unda unum\nstagnumque pocula adhuc. Coeptus *talis corpore* nervos stridit morte perque in\ninquam dicit, linguam.\n\n- Fugat corpore et erant\n- Quas in me mutet\n- Aurora geminas animos\n- Qui puer quantumque\n- Respice est ferebat tutos saepe et dapibus\n\nEsse sacra estque sed, de pondere tui arbor scit turba in placuit tulit Delphice\nterris temptare? Socios sua caelo collocat coepit sociantem antemnae; opus orbis\nin templa exhausto, quis utque precesque. Inmotusque hamis eodem illinc cecidere\nfictamque luctibus deosque, vocatur est una indigenae regis, ait suo hoc, vani.\nAmoris uno huc squamaque iaculum conserto torta omnia tamen invitam, septem et\nibat nequit aequantur est hydrae vagina.\n`;\n\nreturn <Markdown text={tos} />;\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/michaelpeter.near/widget/TosContentDraft"}