{"tx_hash": "CRwocjGpRjmSDM6Ub6MExGY6msiq5C8wDYtpkkgtY8Xu", "action_id_social": "3YVpamyj5vRcUYmEFwhvb6UiPXCpGkZmKQLHBz6TX6WQ-0-widget", "block_id": 85740439, "block_timestamp": "2023-02-21 19:50:39.701", "signer_id": "michaelpeter.near", "widget_name": "TosContentDraft", "source_code": "const tos = `\n# alpha.near.org terms of service\n\n## Clarum docto extra det sub nova\n\nLorem markdownum expendite luminibus tenent quoque, sustinet iuxta, et revocare\nne potes, Theseus nulla volutant erunt plus. Loqui regna et deum Iuventae quas,\nconsulit adsiduis invenit in origine referat inhaesi Typhoea desine, Herculis\nEnipeus. Pentheus ipse officium clamat saturatos concessa, in fretum eo\nconiunctaque si femina et Iapetionides fugit furit nebulas. Se et nunc paterer\npaelicis et totum reflectitur facta protinus salignis fortibus prius Lacon\nmortisque, variarum? Montibus inmoritur meruere laquei, generis Athamanas\nnympham tantaque, amoris caeruleum prohibete inhospita curruque legit; *tactus*\nuna primis.\n\n## Fuerat sit et fatetur innixamque hoc\n\nAccepisse lascivaque ausa tempora urna non corpore facta aequora nostrae. Par\nlecto solutus geminis tacta: est annum, pudorem nititur teste caput Baccho;\nvellet inscripta probat ultima. Caicus et tempora aliter quondam lacertis fato\nexit sequentur **illo**; Iovi Phoebus quae Sabaea verba summo suus. Regia\ninvadunt circuiere sequenti remos in geri aliamve, quies quae dixi manu Musa\ninpune, huc temptamenta vir. Adhuc in gramen parari columnae et esse, sed tamen\nprima Apolline, ad acuta tantum.\n\n    var pageGrepAdd = cmykCompatible;\n    if (enterpriseServerSprite(cms)) {\n        key_error = pcmcia;\n        led_vaporware.filePathWeb(utf, shareware);\n    }\n    piracyDual(recordPointLink, blu_console, 18 * partition);\n\n## Adhuc ergo sub rettulit mihi lacrimisque refugam\n\nTamen [in retentus cum](http://www.quem-cognoscere.org/) faciem Aeneae parabat\nnumero metuit **priorum quotiensque** canos? Serpentis mox esse sua leporem\nPhoebi culpa utroque, me supra tantorum o?\n\nDuratos dextroque, in Haec deprendere vixque? Omne signum humi iactata; signatum\ncorneus credens!\n\n## Praecluserat ossa consulat iussa\n\nOthryn ruit nervis utile. Se tam totumque, Lelegas et vulnus **vetustas**\nmatresque deae lambit me. Flores inrumpere optes silvisque sumptoque modo totam;\net sparso proxima poenaeque et amor *tantum occupet caelatus* honores.\nCircumstant Iuppiter fera domitae corpore viderat suco aperire primum occubuisse\ntectus. Qua solent litus, nec vina ut plagas illis honoris, ante querenda non\nSiculique.\n\nMaiora esse puppes pendere, hoc decoro eripiunt hostisque perire movet, quanto.\nVolucris monstris reponit et ante ora, fuit, et!\n`;\n\nreturn <Markdown text={tos} />;\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/michaelpeter.near/widget/TosContentDraft"}