{"tx_hash": "2Nj4LGCoyD5B16xFjsDeTcUMfzhgUpx9JCDc3PwVZLNZ", "action_id_social": "GunSKHJA7h1N8h2K9QaGafX2Kc33LuaX14Mk45cXj5QB-0-widget", "block_id": 88337062, "block_timestamp": "2023-03-29 02:40:06.214", "signer_id": "chloe.near", "widget_name": "Marma-J-Labs", "source_code": "const accountId = props.accountId ?? context.accountId;\nconst jobPostingMarkdown = `\n# Research Intern (Hiring)\nCompany: Marma J Labs\n\nLocation: Antigua and Barbuda\n\nDuration: Summer Internship (May - September)\n\nCompensation: $10-15 per hour in XCD (Eastern Caribbean Dollars)\n\n## About Marma J Labs\n\nMarma J Labs is a tech-based non-profit organization that aims to educate and empower young tech founders in the twin island nation of Antigua and Barbuda. We focus on supporting innovative research projects in the areas of blockchain, cryptography, and general web3 technologies, with a strong emphasis on the NEAR Protocol ecosystem. One of our key projects includes the Marma J Gaming project.\n\nWe are currently seeking highly motivated and passionate research interns to join our Founder Development Program for a summer internship opportunity.\n\n## Responsibilities\n\n- Collaborate with the Marma J Labs team on research projects related to blockchain, cryptography, and web3 technologies.\n- Contribute to the development of the Marma J Gaming project.\n- Engage in hands-on learning experiences and work on real-world projects.\n- Attend regular mentorship sessions and receive guidance from industry experts.\n- Develop and refine the skills needed to become a successful tech founder.\n\n## Requirements\n\n- Currently enrolled in or recently graduated from a Computer Science or related program.\n- Strong interest in blockchain, cryptography, and web3 technologies.\n- Passion for building tech products and a desire to grow as a tech founder.\n- Excellent communication and teamwork skills.\n\n## Benefits\n\n- Paid internship with competitive hourly rates.\n- Opportunity to work on cutting-edge research projects in the blockchain and web3 space.\n- Receive mentorship and support from industry experts to help you transition into a successful tech founder.\n- Develop your skills and experience in a supportive and educational environment.\n- Potential for long-term career opportunities with Marma J Labs and its projects.\n\n## How to Apply\n\nPlease send your resume and a cover letter detailing your interest in the internship and your aspirations as a tech founder to info@marmaj.org. An application form will be available shortly.\n\n## Application Deadline\n\nWe are reviewing applications on a rolling basis, so we encourage interested candidates to apply as soon as possible, as positions may fill up quickly.\n\nJoin Marma J Labs and contribute to the future of tech innovation in Antigua and Barbuda while setting yourself up for success as a tech founder! We look forward to reviewing your application.\n`;\n\nif (!accountId) {\n  return (\n    <div>\n      <p>Please connect your NEAR wallet or create a new one:</p>\n      <a href=\"https://shard.dog/go\" target=\"_blank\" rel=\"noreferrer\">\n        <button>Create NEAR Wallet</button>\n      </a>\n    </div>\n  );\n}\n\nreturn (\n  <div>\n    <div className=\"mb-3\">\n      <h1>Marma J Labs</h1>\n      <h2>Projects:</h2>\n\n      <button\n        onClick={() => window.open(\"https://marmaj.org/gaming\", \"_blank\")}\n      >\n        Marma J Gaming\n      </button>\n      <button\n        onClick={() =>\n          window.open(\"https://allie-marketplace.vercel.app/\", \"_blank\")\n        }\n      >\n        Allies Marketplace\n      </button>\n\n      <p>\n        Join the Marma J Labs community on Telegram:{\" \"}\n        <a href=\"https://t.me/marmajdao/17452\" target=\"_blank\" rel=\"noreferrer\">\n          https://t.me/marmajdao/17452\n        </a>\n      </p>\n    </div>\n    <p>\n      Interested in joining Marma J Labs? Please check out our internship\n      posting below:\n    </p>\n    <div className=\"mb-3\">\n      <div className=\"container border border-info pt-3 min-vw-100\">\n        <Markdown text={jobPostingMarkdown} />\n      </div>\n    </div>\n  </div>\n);\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/chloe.near/widget/Marma-J-Labs"}