{"tx_hash": "9uL5eQcqfdBwvFS6LDh2mjymPTNuXZVygh2LA8XxYoL6", "action_id_social": "4SyWiSUAs8bqMwdnA4i3db3nfxdDx3M5vVSoGiTfFRoH-0-widget", "block_id": 85963113, "block_timestamp": "2023-02-24 20:22:40.886", "signer_id": "thebos.near", "widget_name": "CantopiaTerms", "source_code": "const content = `\nUpdated: 2/24/2023\n\nTerms of Use\n\nWelcome to cantopia.pages.dev, a website (\"Site\") provided by Proximity Labs Limited (BVI) (\"Proximity\", \"we\", \"our\", or \"us\").\n\nTHE SITE DOES NOT FACILITATE ANY ASPECT OF BLOCKCHAIN BASED DIGITAL ASSET TRANSACTIONS. THE SITE MERELY PROVIDES A SET OF TOOLS FOR USERS TO VIEW AND LOCALLY INTERACT WITH CODE THAT MAY BE RELEVANT TO BLOCKCHAIN BASED NETWORKS. THE ACCURACY, COMPLETENESS, OR USEFULNESS OF INFORMATION PRESENTED ON THE SITE IN CONNECTION WITH THESE TOOLS AND ANY CODE PROVIDED BY USERS IS NOT GUARANTEED BY US. THE OWNER/OPERATOR OF THE SITE DOES NOT HAVE CUSTODY OVER YOUR ASSETS OR ACCESS TO YOUR PRIVATE KEY AND CANNOT INITIATE A TRANSFER OF DIGITAL ASSETS OR OTHERWISE ACCESS YOUR DIGITAL ASSETS.\n\nTHE SITE IS NOT A BROKER OR INTERMEDIARY AND IS IN NO WAY YOUR AGENT, ADVISOR, OR CUSTODIAN, AND WE DO NOT HAVE A FIDUCIARY RELATIONSHIP OR OBLIGATION TO YOU REGARDING ANY OTHER DECISIONS OR ACTIVITIES THAT YOU EFFECT WHEN USING YOUR WALLET TO INTERACT WITH ANY BLOCKCHAIN PROTOCOL.\n\nWE ARE NOT RESPONSIBLE FOR ANY ACTIVITIES THAT YOU ENGAGE IN WHEN USING BLOCKCHAIN TECHNOLOGIES, AND YOU SHOULD UNDERSTAND THE RISKS ASSOCIATED WITH PARTICIPATING IN DECENTRALIZED PROTOCOLS ON NEAR, ETHEREUM, CANTO, OR OTHER BLOCKCHAINS.\n\nThis Terms of Use Agreement (the \"Terms\" or \"Agreement\") explains the terms and conditions by which you may access and use the Site. Please read this Agreement carefully. This Agreement applies to you (\"You\") as a user of the Site. _ **This Agreement contains a mandatory individual arbitration and class action/jury trial waiver provision that requires the use of arbitration on an individual basis to resolve disputes, rather than jury trials or class actions.** _\n\nTo use the Site, you must be able to form a legally binding contract online either as an individual or on behalf of a legal entity. To that end, you represent that, if you are agreeing to this Agreement on behalf of a legal entity, you have the legal authority to bind the company or other legal entity to this Agreement and you are at least 18 years old or the age of majority where you reside, whichever is older, can form a legally binding contract online, and have the full, right, power, and authority to enter into and to comply with the obligations under this Agreement.\n\nYou are advised to check this Agreement periodically to familiarize yourself with any changes to the terms. We, in our sole discretion, reserve the right to make changes to our terms of use. Changes are binding on users of the Site and will take effect immediately upon posting. As a user, you agree to be bound by any changes, variations, or modifications to our terms of use and your continued use of the Site shall constitute acceptance of any such changes, variations, or modifications.\n\nBy accessing or using the Site, you signify that you have read, understand, and agree to be bound by this Agreement in its entirety. _If you do not agree, you are not authorized to access or use the Site._\n\n1. Site\n\nThe Site provides information about and a set of tools for users to locally run or view code that may be relevant to blockchain based protocols built on L1 and L2 blockchains like Ethereum, NEAR, and Canto. In particular, the Site contains a specially designed virtual machine capable of locally loading and running \"front end\" components (\"Components\") for blockchain based application layer protocols on any L1 or L2 blockchains. The code for these Components can be viewed via the Site, similar to viewing a smart contract in Etherscan.\n\nYou acknowledge and agree that Proximity has no control over the NEAR blockchain protocol, and otherwise has no control over any blockchain, protocol, smart contract, or blockchain-based applications. Any interaction with a Component is a locally run instance by the user and not known to or otherwise under the control of Proximity.\n\n2. Access\n\nAccess to the Site is provided \"as is\" and on an \"as available\" basis only. We do not guarantee that the Site, or any content on it, will always be available or uninterrupted. From time to time, access may be interrupted, suspended, or restricted, including because of a fault, error, unforeseen circumstances, or because we are carrying out planned maintenance.\n\nWe reserve the right to limit the availability of the Site to any person, geographic area, or jurisdiction we so desire and/or to terminate your access to and use of the site, at any time and in our sole discretion.\n\nWe may remove or amend the content of the Site at any time. However, some of the content may be out of date at any given time and we are under no obligation to update it. We do not guarantee that the Site, or any content on it, will be free from errors or omissions.\n\nWe will not be liable to you for any loss or damage you may suffer as a result of the Site being unavailable at any time for any reason.\n\nYou are solely responsible for your use of the Site. You acknowledge and understand that the Site merely provides information and a set of tools to locally run or view fully onchain Components. To the extent you locally run any Component that results in interaction with a blockchain-based protocol requiring the use of a blockchain account, you agree to take appropriate action to secure, protect and backup your accounts in a manner that will provide appropriate security and protection, which might include use of encryption. This includes your obligation under this Agreement to record and securely maintain any passwords or backup security phrases (i.e. \"seed\" phrases) that relate to your use of any blockchain. You acknowledge that you will not share with us nor any other third party any password or backup/seed phrase that relates to your use of the Site, and that we will not be held responsible if you do share any such phrase or password.\n\nThere are no fees or charges for use of the Site. Use of blockchain protocol networks are typically subject to third-party transaction fees. Any interaction with a blockchain protocol network is a locally run instance and, as a result, Proximity has no knowledge of such interactions, does not receive such fees, and has no ability to reverse or refund any amounts paid in error to initiate any transaction.\n\n3. Eligibility\n\nTo access or use the Site, you must be able to form a legally binding contract with us. Accordingly, you represent that you are at least eighteen years old and have the full right, power, and authority to enter into and comply with the terms and conditions of this Agreement on behalf of yourself and any company or legal entity for which you may access or use the Site. You further represent that you are not a citizen, resident, or member of any jurisdiction or group that is subject to economic sanctions, or where your use of the Site would be illegal or otherwise violate any applicable law. You further represent that your access and use of the Site will fully comply with all applicable laws and regulations, and that you will not access or use the Site to conduct, promote, or otherwise facilitate any illegal activity.\n\n4. Modification of this Agreement\n\nWe reserve the right, in our sole discretion, to modify this Agreement from time to time. If we make any modifications, we will notify you by updating the date at the top of the Agreement and by maintaining a current version of the Agreement at http://cantopia.pages.dev/terms. All modifications will be effective when they are posted, and your continued use of the Site will serve as confirmation of your acceptance of those modifications. If you do not agree with any modifications to this Agreement, you must immediately stop accessing and using the Site.\n\n5. Proprietary Rights\n\nEach User, subject to and conditioned upon such User's eligibility under and acceptance of and adherence to these Terms, is hereby granted a personal, revocable, non-exclusive, non-transferable, non-sub-licensable license to view, access and use the Site for permitted activity in accordance with this Agreement. The HTML and other software code and text used in the Site (other than certain proprietary third-party fonts) will be available in various repositories at [https://github.com/CantopiaIsBos](https://github.com/CantopiaIsBos), and will be freely licensed under the applicable license set forth in each such repository. The BOS contracts will be available in various repositories at [https://github.com/NearSocial](https://github.com/NearSocial) and will be freely licensed under the applicable license set forth in each such repository.\n\n6. Privacy\n\nYour privacy is important to us. Please refer to our Privacy Policy for information regarding aggregate data that may be collected by us or our service providers. We cannot guarantee that unauthorized third parties will never be able to obtain or use your data or aggregate data for improper purposes. By accessing and using the Site, you acknowledge that we are not responsible for any of these variables or risks, do not own or control any blockchain protocol contracts or the Ethereum blockchain, NEAR protocol, or any other L1 or L2 blockchains, and cannot be held liable for any improperly accessed data, whether resulting in losses that you experience while accessing or using the Site or otherwise.\n\n7. Prohibited Activity\n\nYou agree not to engage in, or attempt to engage in, any of the following categories of prohibited activity in relation to your access and use of the Site:\n\n- Intellectual Property Infringement. Activity that infringes on or violates any copyright, trademark, service mark, patent, right of publicity, right of privacy, or other proprietary or intellectual property rights under the law.\n- Cyberattack. Activity that seeks to interfere with or compromise the integrity, security, or proper functioning of any computer, server, network, personal device, or other information technology system, including (but not limited to) the deployment of viruses and denial of service attacks.\n- Fraud and Misrepresentation. Activity that seeks to defraud us or any other person or entity, including (but not limited to) providing any false, inaccurate, or misleading information in order to unlawfully obtain the property of another.\n- Market Manipulation. Activity that violates any applicable law, rule, or regulation concerning the integrity of trading markets, including (but not limited to) the manipulative tactics commonly known as spoofing and wash trading.\n- Other Harmful Acts. Attempts to engage in or engage in, any potentially harmful acts that are directed against Proximity, including but not limited to violating or attempting to violate any security features, using manual or automated software or other means to access, \"scrape,\" \"crawl\" or \"spider\" any pages contained in or on the Site, introducing viruses, worms, or similar harmful code into the Site, or interfering or attempting to interfere with use of the Site by any other user, host or network, including by means of overloading, \"flooding,\" \"spamming,\" \"mail bombing,\" or \"crashing\" the Site or any other Proximity properties.\n- Sanctions. Activity for or on behalf of any other person who is, (a) located or ordinarily resident in Cuba, Iran, North Korea, Sudan, Syria, any of the the Crimea, Donetsk People's Republic (DNR) or Luhansk People's Republic (LNR) regions of Ukraine, or any other country or any other country or jurisdiction against which the U.S., U.K., E.U. or other nation or international organization maintains economic sanctions; (b) listed by the U.S., U.K., E.U. or other nation or international organization the a prohibited party; or (c) subject to any other national or international sanctions or export controls under any law or by the U.S., U.K., E.U. or other nation or international organization (collectively referred to as \"Restricted Territories\" or a \"Restricted Territory\").\n- Any Other Unlawful Conduct. Activity that violates any applicable Law, including, without limitation, any relevant and applicable anti-money laundering and anti-terrorist financing laws and any relevant and applicable privacy and data collection laws, in each case as may be amended.\n\n8. No Professional Advice\n\nAll information provided by the Site is for informational purposes only and should not be construed as professional advice. In particular, the content and materials available on the Site does not constitute any form of advice or recommendation by us, should not be regarded as an offer, solicitation, invitation or recommendation to buy or sell investments, securities or any other financial services and is not intended to be relied upon by you in making any specific investment or other decisions. You should not take, or refrain from taking, any action based on any information contained in the Site. Before you make any financial, legal, or other decisions involving the Site, you should seek independent professional advice from an individual who is licensed and qualified in the area for which such advice would be appropriate.\n\nNothing included in the Site constitutes an offer or solicitation to sell, or distribution of, investments and related services to anyone in any jurisdiction.\n\n9. Third-Party Links\n\nThe Site may contain hyperlinks or references to third party websites. Any such hyperlinks or references are provided for your information and convenience only. We have no control over third party websites and accept no legal responsibility for any content, material or information contained in them. The display of any hyperlink and reference to any third-party website does not mean that we endorse that third party's website, products or services. Your use of a third-party site may be governed by the terms and conditions of that third-party site.\n\n10. No Warranties\n\nThe Site is provided on an \"AS IS\" and \"AS AVAILABLE\" basis. To the fullest extent permitted by law, we disclaim any representations and warranties of any kind, whether express, implied, or statutory, including (but not limited to) the warranties of merchantability and fitness for a particular purpose. You acknowledge and agree that your use of the Site is at your own risk. We do not represent or warrant that access to the Site will be continuous, uninterrupted, timely, or secure; that the information contained in the Site will be accurate, reliable, complete, or current; or that the Site will be free from errors, defects, viruses, or other harmful elements. No advice, information, or statement that we make should be treated as creating any warranty concerning the Site. We do not endorse, guarantee, or assume responsibility for any advertisements, offers, or statements made by third parties concerning the Site.\n\n11. No Fiduciary Duties\n\nThis Agreement is not intended to, and does not, create or impose any fiduciary duties on us. To the fullest extent permitted by law, you acknowledge and agree that we owe no fiduciary duties or liabilities to you or any other party, and that to the extent any such duties or liabilities may exist at law or in equity, those duties and liabilities are hereby irrevocably disclaimed, waived, and eliminated. You further agree that the only duties and obligations that we owe you are those set out expressly in this Agreement.\n\n12. Assumption of Risk\n\nBy accessing and using the Site, you represent that you understand the inherent risks associated with using cryptographic and blockchain-based systems, and that you have a working knowledge of the usage and intricacies of digital assets.\n\nYou acknowledge and agree that there is significant risk and uncertainty regarding the operation and effects and risks of utilizing novel, experimental, speculative, and experimental cryptographic technologies and blockchain technologies, including tokens, cryptocurrencies, stablecoins, \"smart contracts,\" consensus algorithms, voting systems and distributed, decentralized or peer-to-peer networks or systems in connection with the Site or otherwise.\n\nYou further understand that the markets for digital assets are highly volatile due to factors including (but not limited to) adoption, speculation, technology, security, and regulation. You acknowledge that the cost and speed of transacting with cryptographic and blockchain-based systems are variable and may increase dramatically at any time.\n\nYou further acknowledge that we are not responsible for any of these variables or risks, do not own or control the Ethereum blockchain, NEAR protocol, or any other blockchain system and cannot be held liable for any resulting losses that you experience while accessing or using the Site.\n\nTo the extent you locally run a Component related to digital assets, we make no warranties as to the markets on which digital assets are transferred, purchased, or traded. You acknowledge and understand that the Site does not facilitate such activity and that any activity is a locally run instance that is not known to or under the control of Proximity. You are solely responsible for determining what, if any, taxes apply to any digital asset transactions that you enter with a locally run instance. We are not responsible for determining the taxes that apply to your transactions.\n\nWe do not store, send, or receive digital assets or funds. This is because digital assets exist only by virtue of the ownership record maintained on its supporting blockchain. Any transfer of digital assets occurs within decentralized smart contracts and blockchains and not in or otherwise via the Site. We cannot assist you to cancel or otherwise modify any transaction or transaction details. There are no warranties or guarantees that a transfer initiated via a locally run Component will successfully transfer title or right in any digital asset.\n\nAccordingly, you understand and agree to assume full responsibility for all of the risks of accessing and using the Site and locally running any Component to interact with any blockchain-based protocol.\n\nThe Site provides information regarding and a set of tools for locally interacting with emerging technologies, such as Ethereum, Canto, and NEAR. Your decision to locally run any Component or instance to interact with blockchain protocols is subject to increased risk through your potential misuse of things such as public/private key cryptography, or failing to properly update or run software to accommodate protocol upgrades. By using the Site you explicitly acknowledge and accept these heightened risks.\n\nYou represent that you are financially and technically sophisticated enough to understand the inherent risks associated with using cryptographic and blockchain-based systems and upgrading your software and processes to accommodate protocol upgrades, and that you have a working knowledge of the usage and intricacies of digital assets such as Ether (ETH), Near, and other digital tokens.\n\nIn particular, you understand that these are locally run instances, that we do not operate or control the Ethereum blockchain protocol, Canto blockchain, NEAR blockchain protocol, or any other blockchain protocol, communicate or execute protocol upgrades, or approve or process blockchain transactions on behalf of you.\n\nYou further understand that blockchain protocols present their own risks of use, that supporting or participating in the protocol may result in losses if your participation violates certain protocol rules, that blockchain-based transactions are irreversible, that your private key and backup seed phrase must be kept secret at all times, that Proximity will not store a backup of, nor will be able to discover or recover, your private key or backup seed phrase, and that you are solely responsible for any approvals or permissions you provide by cryptographically signing blockchain messages or transactions.\n\nYou further understand and accept that digital tokens present market volatility risk, technical software risks, regulatory risks, and cybersecurity risks. You understand that the cost and speed of a blockchain-based system is variable, that cost may increase dramatically at any time, and that cost and speed is not within the capability of Proximity to control. You understand that protocol upgrades may inadvertently contain bugs or security vulnerabilities that may result in loss of functionality and ultimately funds.\n\nYou understand and accept that Proximity does not control any blockchain protocol, nor does Proximity control any smart contract that is not otherwise offered by Proximity.\n\nYou agree that you alone, and not Proximity, is responsible for any transactions that you engage in with regard to supporting any blockchain protocol whether through transaction validation or otherwise, or any transactions that you engage in with any third-party-developed smart contract or token, including tokens that were created by a third party for the purpose of fraudulently misrepresenting affiliation with any blockchain project.\n\nYou agree that Proximity is not responsible for the regulatory status or treatment of any digital assets that you may access or transact with using a locally run Component. You expressly assume full responsibility for all of the risks of accessing and using the offerings to interact with blockchain protocols.\n\n13. Release of Claims\n\nYou expressly agree that you assume all risks in connection with your access and use of the Site and your interaction with the Protocol. You further expressly waive and release us from any and all liability, claims, causes of action, or damages arising from or in any way relating to your use of the Site and your interaction with the Protocol. If you are a California resident, you waive the benefits and protections of California Civil Code § 1542, which provides: \"[a] general release does not extend to claims that the creditor or releasing party does not know or suspect to exist in his or her favor at the time of executing the release and that, if known by him or her, would have materially affected his or her settlement with the debtor or released party.\"\n\n14. Indemnity\n\nYou agree to hold harmless, release, defend, and indemnify us and our officers, directors, employees, contractors, agents, affiliates, and subsidiaries from and against all claims, damages, obligations, losses, liabilities, costs, and expenses arising from: (a) your access and use of the Site; (b) your violation of any term or condition of this Agreement, the right of any third party, or any other applicable law, rule, or regulation; and (c) any other party's access and use of the Site with your assistance or using any device or account that you own or control.\n\n15. Limitation of Liability\n\nUnder no circumstances shall we or any of our officers, directors, employees, contractors, agents, affiliates, or subsidiaries be liable to you for any indirect, punitive, incidental, special, consequential, or exemplary damages, including (but not limited to) damages for loss of profits, goodwill, use, data, or other intangible property, arising out of or relating to any access or use of the Site, nor will we be responsible for any damage, loss, or injury resulting from hacking, tampering, or other unauthorized access or use of the Site or the information contained within it. We assume no liability or responsibility for any: (a) errors, mistakes, or inaccuracies of content; (b) personal injury or property damage, of any nature whatsoever, resulting from any access or use of the Site; (c) unauthorized access or use of any secure server or database in our control, or the use of any information or data stored therein; (d) interruption or cessation of function related to the Site; (e) bugs, viruses, trojan horses, or the like that may be transmitted to or through the Site; (f) errors or omissions in, or loss or damage incurred as a result of the use of, any content made available through the Site; and (g) the defamatory, offensive, or illegal conduct of any third party. Under no circumstances shall we or any of our officers, directors, employees, contractors, agents, affiliates, or subsidiaries be liable to you for any claims, proceedings, liabilities, obligations, damages, losses, or costs in an amount exceeding the amount you paid to us in exchange for access to and use of the Site, or $100.00, whichever is greater. This limitation of liability applies regardless of whether the alleged liability is based on contract, tort, negligence, strict liability, or any other basis, and even if we have been advised of the possibility of such liability. Some jurisdictions do not allow the exclusion of certain warranties or the limitation or exclusion of certain liabilities and damages. Accordingly, some of the disclaimers and limitations set forth in this Agreement may not apply to you. This limitation of liability shall apply to the fullest extent permitted by law.\n\n16. Dispute Resolution\n\nWe will use our best efforts to resolve any potential disputes through informal, good faith negotiations. If a potential dispute arises, you must contact us by sending an email to legal@proximity.dev so that we can attempt to resolve it without resorting to formal dispute resolution. If we aren't able to reach an informal resolution within sixty days of your email, then you and we both agree to resolve the potential dispute according to the process set forth below.\n\nAny claim or controversy arising out of or relating to the Site, this Agreement, including any question regarding this Agreement's existence, validity or termination, or any other acts or omissions for which you may contend that we are liable, including (but not limited to) any claim or controversy as to arbitrability (\"Dispute\"), shall be referred to and finally resolved by arbitration administered by the British Virgin Islands International Arbitration Centre (\"BVIIAC\") under the BVIIAC Administered Arbitration Rules in force when the relevant Notice of Arbitration is submitted. The law of this arbitration clause shall be under the laws of the British Virgin Islands. The seat of arbitration shall be the British Virgin Islands. The number of arbitrators shall be one. The arbitration proceedings shall be conducted in English. The arbitration shall be held on a confidential basis before one or three arbitrators, who shall be selected pursuant to BVIIAC Rules.\n\nUnless we agree otherwise, the arbitrator may not consolidate your claims with those of any other party. Any judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction.\n\n17. Class Action and Jury Trial Waiver\n\nYou must bring any and all Disputes against us in your individual capacity and not as a plaintiff in or member of any purported class action, collective action, private attorney general action, or other representative proceeding. This provision applies to class arbitration. You and we both agree to waive the right to demand a trial by jury.\n\n17. Governing Law\n\nYou agree that the laws of British Virgin Islands, without regard to principles of conflict of laws, govern this Agreement and any Dispute between you and us. You further agree that the Site shall be deemed to be based solely in Singapore, and that although the Site may be available in other jurisdictions, its availability does not give rise to general or specific personal jurisdiction in any forum outside of British Virgin Islands.\n\n18. Miscellaneous\n\nWe may perform any of our obligations, and exercise any of the rights granted to us under this Agreement, through a third-party. We may assign any or all our rights and obligations under this Agreement to any third-party.\n\nIf any clause or part of any clause of this Agreement is found to be void, unenforceable or invalid, then it will be severed from this Agreement, leaving the remainder in full force and effect, provided that the severance has not altered the basic nature of this Agreement.\n\nNo single or partial exercise, or failure or delay in exercising any right, power or remedy by us shall constitute a waiver by us of, or impair or preclude any further exercise of, that or any right, power or remedy arising under these terms and conditions or otherwise.\n\nIf any of the provisions in this Agreement is found to be illegal, invalid or unenforceable by any court of competent jurisdiction, the remainder shall continue in full force and effect.\n\nAll disclaimers, indemnities and exclusions in this Agreement shall survive termination of the Agreement and shall continue to apply during any suspension or any period during which the Site is not available for you to use for any reason whatsoever.\n\nWe assume no duties, liabilities, obligations or undertakings to continue operating or maintaining the availability of the Site and may terminate or change the Site in any or all respects at any time. We have no business plan or revenue model for the Site.\n\nWe reserve the right to terminate or limit any person's access to or use of the Site at any time, without or without notice, as determined in our sole and absolute discretion. Such terminations and limitations may be based on any factor or combination of factors, including a person's identity, blockchain address, IP address, internet service provider, virtual provider network provider, metadata, browser software, device type, wallet application, wallet device, region of citizenship or residence or current location, or suspicion that User has engaged or intends to engaged in any Prohibited Activity.\n\nWe reserve the right at all times to cooperate with any governmental or law enforcement investigation or to disclose any information we deem necessary to satisfy any applicable law, regulation, legal process or governmental request, or to edit, refuse to post or to remove any information or materials, in whole or in part, based on any applicable law, regulation, legal process or governmental request, in the our sole and absolute discretion.\n\nIn connection with this Agreement, you will comply with all applicable import, re-import, sanctions, anti-boycott, export, and re-export control laws and regulations, including all such laws and regulations that may apply. For clarity, you are solely responsible for compliance related to the manner in which you choose to use the Site. You may not use the Site if you are the subject of U.S. sanctions or of sanctions imposed by the governments of the country where you are using the Site.\n\nNeither party nor their respective affiliates will be liable for any delay or failure to perform any obligation under this Agreement where the delay or failure results from any cause beyond such party's reasonable control, including but not limited to acts of God, utilities or other telecommunications failures, cyber attacks, earthquake, storms or other elements of nature, pandemics, blockages, embargoes, riots, acts or orders of government, acts of terrorism, or war.\n\n19. About Us\n\nProximity Labs Limited is a BVI Business Company, whose registered office is at Trinity Chambers, P.O. Box 4301, Road Town, Tortola, British Virgin Islands.\n\n20. Contacting Us\n\nIf you have any question about this Agreement, or if you wish to contact us for any reason whatsoever, please send us an email at legal@proximity.dev.\n`;\n\nreturn <Markdown text={content} />;\n", "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/thebos.near/widget/CantopiaTerms", "metadata.tags.ethdenver2023": null}