{"tx_hash": "5Vu2sfUHCpACHsZ7UsyZdNRQFa3ytD2pLkyo5PL7zVNd", "action_id_social": "5EFJ7zDyor2R5FncNMb9XrV265MbeG6fFJJmE5YG2h2r-0-widget", "block_id": 90624484, "block_timestamp": "2023-04-28 12:17:02.220", "signer_id": "nearhorizon.near", "widget_name": "TNCPage", "source_code": "return (\n  <div class=\"c12 c20 doc-content\">\n    <p class=\"c13 title\" id=\"h.alotq4h5zy55\">\n      <h1 class=\"c23\">NEAR Horizon Platform Terms and Conditions</h1>\n    </p>\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <p class=\"c19\">\n      <span class=\"c0\">Last updated: 26 April 2023</span>\n    </p>\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <p class=\"c19\">\n      <span>These terms are entered into by and between you and </span>\n      <span>Discovery Domain</span>\n      <span class=\"c0\">\n        &nbsp;Ltd (&ldquo;Company&rdquo;, &ldquo;we&rdquo; or &ldquo;us&rdquo;).\n        Please read these Terms and Conditions (&ldquo;Terms&rdquo;) carefully\n        before using the NEAR Horizon Platform (&ldquo;Platform&rdquo;). Your\n        access to and use of the Platform is conditional upon your acceptance of\n        and compliance with these Terms. These Terms, together with any\n        documents they expressly incorporate by reference, govern your access to\n        and use of the Platform, any content, functionality and services\n        available or accessible through the Platform. By accessing the Platform,\n        you agree to be bound by these Terms and the [Privacy Policy]\n        incorporated herein by reference. If you do not agree to these Terms you\n        must not access or use the Platform.\n      </span>\n    </p>\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <p class=\"c6\">\n      <span class=\"c0\">\n        THE PLATFORM IS BUILT ON A FULLY DECENTRALIZED BACKEND INFRASTRUCTURE\n        AND DOES NOT FACILITATE ANY ASPECT OF BLOCKCHAIN BASED DIGITAL ASSET\n        TRANSACTIONS. THE PLATFORM MERELY PROVIDES A SET OF TOOLS FOR USERS TO\n        VIEW AND LOCALLY INTERACT WITH CODE THAT MAY ENABLE ACCESS TO\n        INFORMATION AND SERVICES THAT MAY BE RELEVANT TO BLOCKCHAIN BASED\n        PROJECTS. THE ACCURACY, COMPLETENESS, OR USEFULNESS OF INFORMATION OR\n        SERVICES PRESENTED ON OR ACCESSIBLE THROUGH THE PLATFORM IS NOT\n        GUARANTEED AND WE DISCLAIM ANY AND ALL LIABILITY WITH RESPECT TO THE\n        SAME.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        WE ARE NOT BROKERS OR INTERMEDIARIES, AND ARE NOT YOUR AGENT, ADVISOR,\n        OR CUSTODIAN, AND NONE OF THE PARTIES ON THE PLATFORM HAVE A FIDUCIARY\n        RELATIONSHIP OR OBLIGATION TO YOU REGARDING ANY DECISIONS OR ACTIVITIES\n        THAT YOU EFFECT WHEN USING THE PLATFORM. BY USING THE PLATFORM YOU AGREE\n        THAT YOU UNDERSTAND THE RISKS ASSOCIATED WITH PARTICIPATING IN\n        DECENTRALIZED PROTOCOLS AND THAT WE ARE NOT RESPONSIBLE FOR YOUR USE OF\n        THE PLATFORM OR ANY SERVICES THAT YOU ACCESS THROUGH THE PLATFORM.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        FOR THE AVOIDANCE OF DOUBT, WE DO NOT PROVIDE AND ARE NOT RESPONSIBLE\n        FOR THE SERVICES ACCESSIBLE THROUGH THE PLATFORM (SAVE FOR WHERE\n        EXPRESSLY INDICATED IN THESE TERMS).\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        When accessing specific services via the Platform, other terms and\n        conditions may apply (&ldquo;Third Party Terms&rdquo;) and you are\n        solely responsible for reviewing, understanding and adhering to those\n        Third Party Terms.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.64ug08z1mht6\">\n      <span class=\"c8\">The Platform</span>\n      <span class=\"c8\">&nbsp;</span>\n    </h2>\n    <p class=\"c1\">\n      <span>\n        The Platform provides a set of tools that enables users to locally\n        interact with code that can facilitate access to certain locally-run\n        blockchain-based services including a platform where Web3 teams building\n        on the{\" \"}\n      </span>\n      <span>NEAR Protocol </span>\n      <span>\n        or other blockchains (&ldquo;Teams&rdquo;) to: (i) showcase their\n        projects; (ii) get access to mentors and educational information\n        (&ldquo;Mentors&rdquo;); (iii) access potential service providers\n        (&ldquo;\n      </span>\n      <span>Vendors</span>\n      <span>\n        &rdquo;) and supporters of the NEAR Ecosystem (together the &ldquo;\n      </span>\n      <span class=\"c22\">Services</span>\n      <span>&rdquo;)</span>\n      <span class=\"c0\">. </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        The Platform only provides a set of tools that enables users to locally\n        interact with code that can facilitate access to the Services &nbsp;and\n        neither we nor the Platform are responsible for the performance of any\n        Services (or associated activities) unless otherwise expressly stated in\n        these Terms.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        To the extent that you elect to conduct transactions in connection with\n        the Services, all transactions are conducted between you and the\n        relevant third party and we are not a party to them. We are not\n        responsible for the quality, safety, accuracy, or any aspect of the\n        Services (or any other information, goods and/or services facilitated by\n        or accessible through the Platform (regardless of whether such Services\n        (or any other information, goods and/or services) are made available by\n        the Teams, Mentors, Vendors or otherwise) save where expressly\n        indicated.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        The Platform is available to users who are eighteen (18) years of age or\n        older. By accessing or using the Platform, you represent and warrant\n        that you are eighteen (18) years of age or older and of legal age to\n        form a binding contract with us and meet all of the foregoing\n        eligibility requirements. In addition, you represent that you are not a\n        citizen, resident, or member of any jurisdiction or group that is\n        subject to economic sanctions, or where your use of the Platform and\n        Services would be illegal or otherwise violate any applicable law. You\n        further represent that your access and use of the Platform will fully\n        comply with all applicable laws and regulations, and that you will not\n        access or use the Platform to conduct, promote, or otherwise facilitate\n        any illegal activity (including any activity requiring regulatory\n        licenses, without having obtained such). If you do not meet all of these\n        requirements, you must not access or use the Platform.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        You are also responsible for your use of the Platform and any and all\n        Services, including but not limited to any content or material you\n        upload, post or otherwise transmit through the Services. You agree not\n        to use the Platform for any purpose that infringes on the rights of\n        others or is otherwise prohibited by these Terms.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.1yrpghl5es1y\">\n      <span class=\"c8 c9\">NEAR Horizon Credits</span>\n    </h2>\n    <p class=\"c19\">\n      <span>Teams</span>\n      <span>&nbsp;may be allocated NEAR Ho</span>\n      <span>\n        rizon Credits (&ldquo;Credits&rdquo;) and can only redeem these Credits\n        for &nbsp;certain Services{\" \"}\n      </span>\n      <span class=\"c12\">\n        as expressly specified in these Terms, additional terms and conditions\n        applicable to Credits or as expressly provided by us in an individual\n        agreement\n      </span>\n      <span>. </span>\n      <span class=\"c0\">\n        You agree and understand that Credits do not constitute an investment,\n        have no financial value and are not means of payment, grant or otherwise\n        an endorsement of you and/or your project.\n      </span>\n    </p>\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <p class=\"c19\">\n      <span>\n        Credits are used as accounting records and must be used exclusively\n        within the Platform. They are not redeemable,{\" \"}\n      </span>\n      <span>exchangeable</span>\n      <span>&nbsp;for </span>\n      <span>money</span>\n      <span>, transferable, assignable or saleable</span>\n      <span class=\"c0\">\n        . If you cease to use the Platform the Credits will expire\n        unconditionally after one year.\n      </span>\n    </p>\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <p class=\"c6\">\n      <span class=\"c0\">\n        We reserve the right to cancel your access to Credits if we decide\n        (acting reasonably) that you have breached these Terms. The Credits and\n        the use of Credits may be subject to further terms and conditions.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span>\n        WE DO NOT HAVE CUSTODY OVER YOUR ASSETS OR ACCESS TO YOUR PRIVATE KEY\n        AND CANNOT INITIATE A TRANSFER OF DIGITAL ASSETS OR OTHERWISE ACCESS\n        YOUR DIGITAL ASSETS.\n      </span>\n    </p>\n    <p class=\"c11\">\n      <span class=\"c0\">\n        The Services that you access via the Platform and run locally may allow\n        you to create or connect a digital wallet holding digital assets to your\n        account and/or to hold, transfer or otherwise interact with digital\n        assets. You understand that we do not hold your assets and take no\n        custody of them. We have no access to your assets or funds and we do not\n        operate or provide the Services (save where expressly indicated in the\n        case of the Services only). It is your responsibility to ensure that you\n        maintain control of your digital assets on the Services run locally by\n        you. Once you purchase or sell a digital asset, the transaction cannot\n        be canceled or recalled. Once a transaction has been recorded in a\n        digital wallet as instructed when the transaction was initiated, it\n        cannot be recalled or retrieved under any circumstances.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span>\n        We and our service providers are not responsible for the keys to any\n        digital assets or your seed phrase, or their loss or disclosure to\n        others. It is your responsibility at all times to ensure you have such\n        credentials and maintain them securely. Any losses you suffer as a\n        result of loss of control of, disclosure or unauthorized use of your\n        digital keys is your responsibility and you hereby indemnify us and hold\n        us harmless against any claims or losses arising from your loss of the\n        digital keys to your wallet or their use by third parties. PLEASE KEEP\n        YOUR SEED PHRASE AND DIGITAL KEYS SAFE, AS WE AND OUR SERVICE PROVIDERS\n        DO NOT HAVE THEM AND DO NOT KNOW THEM. IF YOU LOSE THE KEYS OR SEED\n        PHRASE, YOU MAY LOSE ACCESS TO YOUR ASSETS.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.nckj6ltde5qf\">\n      <span class=\"c8\">Risks</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        You agree and understand that under no circumstances will the operation\n        or use of the Platform (or access or use of any Services) be deemed to\n        create a relationship between you and us that includes the provision of\n        or tendering of investment advice. NO FINANCIAL, INVESTMENT, TAX, LEGAL\n        OR SECURITIES ADVICE IS GIVEN THROUGH OR IN CONNECTION WITH THE\n        PLATFORM. We do not provide or control the Services and have no\n        responsibility for them (save where expressly indicated). No content\n        found on the Platform, whether created by us, Teams, Mentors or Vendors\n        is or should be considered as investment advice. You agree and\n        understand that we accept no responsibility whatsoever for, and shall in\n        no circumstances be liable in connection with, your decisions or your\n        use of the Platform or the Services. Nothing contained in the Platform\n        constitutes a solicitation, recommendation, endorsement, or offer by us\n        or any third party to buy or sell any digital assets, securities, or\n        other financial instruments.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        You acknowledge that the Platform and/or the Services could have bugs or\n        security vulnerabilities, and you hereby accept this risk. You hereby\n        hold us harmless from any losses you suffer as a result of your use of\n        the Platform and/or the Services.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        The Platform may facilitate access to Services offered by or created by\n        third parties (including but not limited to Vendors). We do not provide\n        or control such Services and any use of such Services by you is at your\n        own risk. We provide no guarantee as to the accuracy, completeness,\n        legality or usefulness of such Services. You acknowledge and agree that\n        we are not responsible for any aspect of the information, content, or\n        services contained in any such third-party Services.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.fc9uxv4hcnu\">\n      <span class=\"c7\">Access to the Platform and Security</span>\n    </h2>\n    <p class=\"c19\">\n      <span class=\"c0\">\n        Access to the Platform is provided &ldquo;as is&rdquo; and on an\n        &ldquo;as available&rdquo; basis only. From time to time access may be\n        interrupted, suspended or restricted, including because of change in\n        third parties, fault, error, unforeseen circumstances or planned\n        maintenance. We reserve the right to limit availability to the Platform\n        to any person, geographical area or jurisdiction and/or to terminate\n        your access to the Platform at any time and in our sole discretion.\n      </span>\n    </p>\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <p class=\"c6\">\n      <span class=\"c0\">\n        We may remove or amend content on the Platform at any time however we do\n        not guarantee that the Platform (and/or any Services)will be free from\n        errors or omissions. We shall not be liable for any loss or damage you\n        may suffer as a result of the Platform (and/or any Services) being\n        unavailable at any time for any reason.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span>\n        You acknowledge and agree that the Platform is built on and operates on\n        a decentralized basis on the NEAR protocol (\n      </span>\n      <span>\n        the decentralized, sharded, developer-friendly, proof-of-stake, layer\n        one blockchain network), and the &ldquo;blockchain operating\n        system&rdquo; that is a common layer for browsing and interacting with\n        the &ldquo;open web&rdquo; and compatible with any blockchain\n      </span>\n      <span class=\"c0\">\n        . You further acknowledge and agree that, as above, the Platform only\n        facilitates access to Services and: (a) we do not provide and have no\n        control over any Services (save as expressly indicated); and (b)\n        &nbsp;we do not operate and we have no control over any decentralized\n        elements of the Platform or any associated smart contract or blockchain\n        protocol (whether the NEAR protocol or otherwise).\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        We reserve the right to withdraw or amend any element of the Platform or\n        Services within our control (or materials provided relating to the\n        Platform) in our sole discretion without notice.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">You are responsible for:</span>\n    </p>\n    <ul class=\"c10 lst-kix_2re47yu2lmby-0 start\">\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Making all arrangements necessary for you to have access to the\n          Platform.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Ensuring that all persons who access the Platform through your\n          internet connection or wallet group are aware of these Terms and\n          comply with them.\n        </span>\n      </li>\n    </ul>\n    <p class=\"c1\">\n      <span>\n        To access the Platform you may be asked to provide certain registration\n        details or other information. It is a condition of your use of the\n        Platform that all the information you provide on or through the Platform\n        is correct, current, complete, and that you have authorisation to\n        provide the same. You agree that all information you provide as part of\n        any registration for the Platform, including but not limited to through\n        the use of any interactive features on the Platform, is governed by th\n      </span>\n      <span>e </span>\n      <span>Privacy Policy</span>\n      <span>, </span>\n      <span>\n        and you acknowledge and agree that we and any service providers shall\n        collect data and information necessary for the Services and consistent\n        with the{\" \"}\n      </span>\n      <span>Privacy Policy</span>\n      <span>. </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        If you choose, or are provided with, a user name, password, or any other\n        piece of information as part of security procedures associated with the\n        Platform, you must treat such information as confidential, and you must\n        not disclose it to any other person or entity. You also acknowledge that\n        your account is for your use only and agree not to provide any other\n        person with access to the Platform using your user name, password, or\n        other security information to any persons who have not agreed to comply\n        with these Terms. As a Vendor you are solely responsible for providing\n        access to authorized users only, when applicable. You agree to notify us\n        immediately of any unauthorized access to or use of (a) your user name\n        or password for the Platform, (b) any unauthorized access to or use of\n        your username or password. You should use particular caution when\n        accessing your account from a public or shared computer so that others\n        are not able to view or record your password or other personal\n        information.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span>\n        We have the right to disable any user name, password, or other\n        identifier used in connection with any registration to use the Platform,\n        whether chosen by you or provided by us, at any time in our sole\n        discretion for any or no reason, including if, in our opinion, you have\n        violated any provision of these Terms.\n      </span>\n    </p>\n    <p class=\"c6\">\n      <span class=\"c0\">\n        Your privacy is important to us. Please read our [Privacy Policy] for\n        more information on the data, including but not limited to aggregated\n        data that may be collected by us or third parties. There are risks\n        associated with having access to the Platform and we cannot guarantee\n        that unauthorized third parties will never obtain access to the data and\n        use it for improper purposes. By accessing or using the Platform you\n        acknowledge and agree that we cannot control data shared on a\n        decentralized protocol and cannot be responsible for improperly accessed\n        data or losses resulting from your use of the Platform.\n      </span>\n    </p>\n    <p class=\"c6\">\n      <span>\n        To the extent you elect to provide personal data (or other sensitive\n        data) in connection with any Services not provided by us, you do so at\n        your own risk. Such Services may be subject to their own privacy\n        policies (or equivalent terms) governing how personal data is processed\n        and stored and it is your responsibility to review, understand and\n        comply with those terms.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.mk2dm11vvm73\">\n      <span class=\"c8\">Prohibited activities </span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        Your use of the Platform must be ethical, and conform to high moral\n        standards. You are prohibited from using the Platform in a manner that\n        is unethical or immoral, or that might be considered disreputable or\n        offensive, including but not limited to:\n      </span>\n    </p>\n    <ul class=\"c10 lst-kix_tfu7uosz833n-0 start\">\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Cyberattack. Activities that seek to interfere with or compromise the\n          integrity, security or proper functioning of the Platform (and/or the\n          Services);\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Fraud and Misrepresentation. Activities or behaviors that seek to\n          defraud us or any provider of Services (such as providing false,\n          inaccurate or misleading information. List not exhaustive);\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Sanctions. Activities for or on behalf of any other person who is\n          located in a country or jurisdiction against which the US, UK, EU or\n          other nations or international organizations maintain economic\n          sanctions; and\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">Any other unlawful conduct.</span>\n      </li>\n    </ul>\n    <p class=\"c1\">\n      <span class=\"c0\">Additionally you agree not to:</span>\n    </p>\n    <ul class=\"c10 lst-kix_dwt0m1b2bi36-0 start\">\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Use the Platform in any way that violates any applicable federal,\n          state, local, or international law or regulation (including, without\n          limitation, any laws regarding the export of data or software to and\n          from the United States or other countries).\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Use the Platform for the purpose of exploiting, harming, or attempting\n          to exploit or harm minors in any way by exposing them to inappropriate\n          content, asking for personally identifiable information, or otherwise.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span>\n          Send, knowingly receive, upload, download, use, or re-use any material\n          that does not comply with the{\" \"}\n        </span>\n        <span>Content Standards</span>\n        <span class=\"c0\">&nbsp;set out in these Terms.</span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Transmit, or procure the sending of, any advertising or promotional\n          material, including any &ldquo;junk mail&rdquo;, &ldquo;chain\n          letter&rdquo;, &ldquo;spam&rdquo;, or any other similar solicitation.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span>Impersonate or attempt to impersonate </span>\n        <span>Company</span>\n        <span class=\"c0\">\n          , a Company employee, another user, or any other person or entity\n          (including, without limitation, by using email addresses or user names\n          associated with any of the foregoing).\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Engage in any other conduct that restricts or inhibits anyone&rsquo;s\n          use or enjoyment of the Platform (and/or Services), or which, as\n          determined by us, may harm Company or users of the Platform (and/or\n          Services) or expose them to liability.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Use any robot, spider, or other automatic device, process, or means to\n          access the Platform for any purpose, including monitoring or copying\n          any of the material on the Platform.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Use the Platform in any manner that could disable, overburden, damage,\n          or impair the Platform (and/or Services) or interfere with any other\n          party&rsquo;s use of the Platform (and/or Services), including their\n          ability to engage in real time activities through the Platform (and/or\n          Services).\n        </span>\n      </li>\n    </ul>\n    <h2 class=\"c4\" id=\"h.ss2qwo4k2ujk\">\n      <span class=\"c7\">User Contributions</span>\n    </h2>\n    <p class=\"c1\">\n      <span>\n        For the purpose of this Section, the term &lsquo;User&rsquo; refers to\n        all users of the Platform including but not limited to Founders, Teams,\n        Mentors and Vendors.{\" \"}\n      </span>\n      <span>\n        The Platform may facilitate access to Services that allow you to upload,\n        post, submit, display, or transmit to other users or other persons\n        content or materials (collectively, &ldquo;User Contributions&rdquo;).\n      </span>\n      <span class=\"c0\">\n        &nbsp;Any uploaded material, developments, updates, modifications,\n        customizations, configurations, improvements or other contributions that\n        you make shall be deemed a User Contribution.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        All User Contributions must comply with the Content Standards set out in\n        these Terms.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        Any User Contribution that you develop using code or materials made\n        available on or through the Platform and any User Contribution that you\n        via any Service accessible through the Platform will be considered\n        non-confidential and non-proprietary. By providing any User Contribution\n        via a Service accessible through the Platform, you grant us and our\n        third party service providers, and other users, and each of their and\n        our respective licensees, successors, and assigns the right to use,\n        reproduce, modify, perform, display, create derivative works of,\n        distribute, and otherwise disclose to third parties any such material\n        for any purpose consistent with these Terms.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        You represent and warrant that (i) you own or control all rights in and\n        to the User Contributions and have the right to grant the license\n        granted above to us, our third party service providers, and other users\n        and each of their and our respective licensees, successors, and assigns;\n        and (ii) all of your User Contributions do and will comply with these\n        Terms.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        You understand and acknowledge that you are responsible for any User\n        Contributions you submit or contribute, and you, not us, have full\n        responsibility for such content, including its legality, reliability,\n        accuracy, and appropriateness.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        We are not responsible or liable to any third party for the content or\n        accuracy of any User Contributions posted by you or any other user of\n        the Platform.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.xz7u103eoukd\">\n      <span class=\"c7\">Monitoring and Enforcement; Termination</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        We have the right (in each case to the extent we are able to do so) to:\n      </span>\n    </p>\n    <ul class=\"c10 lst-kix_bkzflgrrbamu-0 start\">\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Remove or block the posting of any User Contributions for any or no\n          reason at our sole discretion.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Take any action with respect to any User Contribution that we deem\n          necessary or appropriate in our sole discretion, including if we\n          believe that such User Contribution violates these Terms, including\n          the Content Standards, infringes any intellectual property right or\n          other right of any person or entity, threatens the personal safety of\n          users of the Platform (and/or Services) or the public, or could create\n          liability for us.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Disclose your identity or other information about you to any third\n          party who claims that material posted by you violates their rights,\n          including their intellectual property rights or their right to\n          privacy.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Take appropriate legal action, including without limitation, referral\n          to law enforcement, for any actual or suspected illegal or\n          unauthorized use of the Platform.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Terminate or suspend your access to all or part of the Platform for\n          any or no reason, including without limitation, any violation of these\n          Terms.\n        </span>\n      </li>\n    </ul>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        Without limiting the foregoing, we have the right to fully cooperate\n        with any law enforcement authorities or court order requesting or\n        directing us to disclose the identity or other information of anyone\n        using the Platform. YOU WAIVE AND HOLD HARMLESS COMPANY, ITS LICENSORS\n        FROM ANY CLAIMS RESULTING FROM ANY ACTION TAKEN BY ANY OF THE FOREGOING\n        PARTIES DURING, OR TAKEN AS A CONSEQUENCE OF, INVESTIGATIONS BY EITHER\n        SUCH PARTIES OR LAW ENFORCEMENT AUTHORITIES.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        However, we do not undertake to review any material available through\n        the Platform and cannot ensure prompt removal of objectionable material\n        after it has been posted. Accordingly, we do not assume any liability\n        for any action or inaction regarding transmissions, communications, or\n        content provided by any user or third party. We do not have any\n        liability or responsibility to anyone for performance or nonperformance\n        of the activities described in this section.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.db591n91slry\">\n      <span class=\"c7\">Content Standards</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        These content standards apply to any and all User Contributions made by\n        you in connection with the Platform. User Contributions must in their\n        entirety comply with all applicable federal, state, local, and\n        international laws and regulations. Without limiting the foregoing, User\n        Contributions must not:\n      </span>\n    </p>\n    <ul class=\"c10 lst-kix_98j484k3i4xg-0 start\">\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Contain any material that is defamatory, obscene, indecent, abusive,\n          offensive, harassing, violent, hateful, inflammatory, or otherwise\n          objectionable.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Promote sexually explicit or pornographic material, violence, or\n          discrimination based on race, sex, religion, nationality, disability,\n          sexual orientation, or age.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Infringe any patent, trademark, trade secret, copyright, or other\n          intellectual property or other rights of any other person.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Violate the legal rights (including the rights of publicity and\n          privacy) of others or contain any material that could give rise to any\n          civil or criminal liability under applicable laws or regulations or\n          that otherwise may be in conflict with these Terms and the Privacy\n          Policy.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">Be likely to deceive any person.</span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Promote any illegal activity, or advocate, promote, or assist any\n          unlawful act.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Cause annoyance, inconvenience, or needless anxiety or be likely to\n          upset, embarrass, alarm, or annoy any other person.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Impersonate any person, or misrepresent your identity or affiliation\n          with any person or organization.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Involve commercial activities or sales, such as contests, sweepstakes\n          and other sales promotions, barter, or advertising.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Give the impression that they emanate from or are endorsed by us or\n          any other person or entity, if this is not the case.\n        </span>\n      </li>\n    </ul>\n    <h2 class=\"c4\" id=\"h.52hewp8esejz\">\n      <span class=\"c7\">Copyright Infringement</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        If you believe that any User Contributions violate your copyright,\n        please see our Copyright Policy set forth below for instructions on\n        sending us a notice of copyright infringement. It is our policy to\n        terminate the user accounts of repeat infringers, to the extent such\n        accounts are within our control.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        If you believe that any content on the Platform violates your copyright,\n        please send us a note using the contact information below.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        Notwithstanding anything else to the contrary in these Terms or\n        elsewhere, you acknowledge and agree that the Services operate on a\n        decentralized and are not controlled by us (save where expressly\n        indicated), and that, due to the immutable nature of the blockchain, we\n        might not be able to remove content.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c5\">Reporting Claims of Copyright Infringement</span>\n    </p>\n    <p class=\"c1\">\n      <span>\n        We take claims of copyright infringement seriously and we will endeavor\n        to respond to notices of alleged copyright infringement that comply with\n        applicable law. If you believe any materials accessible via the Platform\n        infringe your copyright, you may request removal of those materials (or\n        access to them) from the Platform, by submitting written notification to\n        us via{\" \"}\n      </span>\n      <span class=\"c22\">horizon@near.foundation</span>\n      <span class=\"c0\">&nbsp;with the following information:</span>\n    </p>\n    <ul class=\"c10 lst-kix_y28xcqo5rqg5-0 start\">\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">Your physical or electronic signature.</span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Identification of the copyrighted work you believe to have been\n          infringed or, if the claim involves multiple works on the Platform, a\n          representative list of such works.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Identification of the material you believe to be infringing in a\n          sufficiently precise manner to allow us to locate that material.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          Adequate information by which we can contact you (including your name,\n          postal address, telephone number, and email address).\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          A statement that you have a good faith belief that use of the\n          copyrighted material is not authorized by the copyright owner, its\n          agent, or the law.\n        </span>\n      </li>\n      <li class=\"c1 c2 li-bullet-0\">\n        <span class=\"c0\">\n          A statement that the information in the written notice is accurate.\n        </span>\n      </li>\n    </ul>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        Please be aware that if you knowingly materially misrepresent that\n        material or activity on the Platform is infringing your copyright, you\n        may be held liable for damages (including costs and attorneys&rsquo;\n        fees) under applicable law.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">BLOCKCHAIN DISCLAIMER:</span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        To the extent your claims of copyright infringement relate to any\n        materials on the blockchain, given the decentralized, immutable nature\n        of the blockchain, we cannot guarantee that we can remove such content.\n        In such instances, if commercially feasible, we may attempt to add a\n        note to the blockchain informing the public that the content is under\n        review or considered infringing.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.6al95dbohft2\">\n      <span class=\"c7\">Reliance on Information Posted</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        We do not warrant the accuracy, completeness, or usefulness of any\n        information or materials available through the Platform (and/or the\n        Services). Any reliance you place on such information is strictly at\n        your own risk. We hereby disclaim all liability and responsibility\n        arising from any reliance placed on such materials or information by\n        you, or by anyone who may be informed of any of its contents.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        To the extent that the Platform facilitates access to content available\n        in connection with Services provided by third parties,, all statements,\n        information and/or opinions expressed in those materials, and all\n        articles and responses to questions and other content, are solely the\n        opinions and the responsibility of the person or entity providing those\n        materials. We are not responsible, or liable to you or any third party,\n        for the content or accuracy of any materials accessible via the Platform\n        (and/or the Services).\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.aw98upnw1rdr\">\n      <span class=\"c7\">Third Party Terms</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        Additional terms and conditions may apply to certain Services, and it is\n        your responsibility to carefully read, understand and comply with those\n        Third Party Terms.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.73cxlai8uy5n\">\n      <span class=\"c7\">Geographic Restrictions</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        We make no claims that the Platform (and/or any Services) is or will be\n        accessible or appropriate in any jurisdiction. Access to the Platform\n        (and/or Services) may not be legal by certain persons or in certain\n        countries.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.ip3t9ld9h359\">\n      <span class=\"c7\">Disclaimer of Warranties</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        You understand that we cannot and do not guarantee or warrant that\n        materials available for downloading from the internet or the Platform\n        will be free of viruses or other destructive code. You are responsible\n        for implementing sufficient procedures and checkpoints to satisfy your\n        particular requirements for anti-virus protection and accuracy of data\n        input and output, and for maintaining a means external to the Platform\n        for any reconstruction of any lost data. TO THE FULLEST EXTENT PROVIDED\n        BY LAW, WE WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE CAUSED BY DENIAL OF\n        SERVICE ATTACKS, DISTRIBUTED DENIAL-OF-SERVICE ATTACKS, VIRUSES, OR\n        OTHER TECHNOLOGICALLY HARMFUL MATERIAL THAT MAY INFECT YOUR COMPUTER\n        EQUIPMENT, COMPUTER PROGRAMS, DATA, OR OTHER MATERIAL DUE TO YOUR USE OF\n        THE PLATFORM (AND/OR THE SERVICES) OR YOUR USE OF ANY ITEMS OBTAINED\n        THROUGH THE PLATFORM (AND/OR SERVICES), OR TO YOUR DOWNLOADING OF ANY\n        MATERIAL AVAILABLE THROUGH THE PLATFORM (AND/OR SERVICES), OR ON ANY\n        WEBSITES LINKED TO ANY OF THEM.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        WE DO NOT MAKE ANY WARRANTY OR REPRESENTATION WITH RESPECT TO THE\n        COMPLETENESS, SECURITY, RELIABILITY, QUALITY, OPERATION, FUNCTION,\n        ACCURACY, OR AVAILABILITY OF THE PLATFORM (AND/OR SERVICES). WITHOUT\n        LIMITING THE FOREGOING, WE DO NOT REPRESENT OR WARRANT THAT ANY PART OF\n        THE PLATFORM (AND/OR SERVICES), ANY CONTENT THEREIN, OR ANY ITEMS\n        OBTAINED THROUGH THE PLATFORM, WILL BE ACCURATE, RELIABLE, ERROR-FREE,\n        OR UNINTERRUPTED, THAT DEFECTS WILL BE CORRECTED, THAT THE PLATFORM\n        (AND/OR SERVICES) OR THE TECHNOLOGY THAT MAKES ANY OF THEM AVAILABLE ARE\n        FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS, OR THAT THE PLATFORM AND/OR\n        THE SERVICES AND/OR ITEMS OBTAINED THROUGH THE PLATFORM WILL OTHERWISE\n        MEET YOUR NEEDS OR EXPECTATIONS.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        TO THE FULLEST EXTENT PROVIDED BY LAW, WE HEREBY DISCLAIM ALL WARRANTIES\n        OF ANY KIND, WHETHER EXPRESS OR IMPLIED, STATUTORY, OR OTHERWISE,\n        INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY,\n        NON-INFRINGEMENT, AND FITNESS FOR PARTICULAR PURPOSE WITH RESPECT TO THE\n        PLATFORM (AND/OR SERVICES).\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        THE FOREGOING DOES NOT AFFECT ANY WARRANTIES THAT CANNOT BE EXCLUDED OR\n        LIMITED UNDER APPLICABLE LAW.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.obihexxx4ar7\">\n      <span class=\"c7\">Limitation on Liability</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        TO THE FULLEST EXTENT PERMITTED BY LAW, IN NO EVENT WILL WE, OUR\n        AFFILIATES, OR OUR OR THEIR RESPECTIVE LICENSORS, SERVICE PROVIDERS,\n        EMPLOYEES, AGENTS, OFFICERS, OR DIRECTORS BE LIABLE FOR DAMAGES OF ANY\n        KIND, UNDER ANY LEGAL THEORY, ARISING OUT OF OR IN CONNECTION WITH YOUR\n        USE, OR INABILITY TO USE, THE PLATFORM, AND/OR ANY GOODS, SERVICES,\n        ITEMS OR THIRD-PARTY CONTENT ASSOCIATED WITH THE FOREGOING, INCLUDING\n        ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, CONSEQUENTIAL, OR PUNITIVE\n        DAMAGES, INCLUDING BUT NOT LIMITED TO, PERSONAL INJURY, PAIN AND\n        SUFFERING, EMOTIONAL DISTRESS, LOSS OF REVENUE, LOSS OF PROFITS, LOSS OF\n        BUSINESS OR ANTICIPATED SAVINGS, LOSS OF USE, LOSS OF GOODWILL, LOSS OF\n        DATA, WHETHER CAUSED BY TORT (INCLUDING NEGLIGENCE), BREACH OF CONTRACT,\n        OR OTHERWISE, EVEN IF FORESEEABLE. YOU AGREE TO HOLD COMPANY AND ITS\n        SERVICE PROVIDERS HARMLESS FROM AGAINST ANY LOSSES YOU MAY INCUR AS A\n        CONSEQUENCE OF USING THE PLATFORM (AND/OR SERVICES). THESE POTENTIAL\n        LOSSES INCLUDE ANY LOSSES FOR FAILED TRANSACTIONS OR SMART CONTRACT\n        BUGS.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        THE FOREGOING DOES NOT AFFECT ANY LIABILITY THAT CANNOT BE EXCLUDED OR\n        LIMITED UNDER APPLICABLE LAW.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.h48mwvbqo0bn\">\n      <span class=\"c7\">Indemnification</span>\n    </h2>\n    <p class=\"c1\">\n      <span>\n        You agree to defend, indemnify, and hold harmless us, our affiliates,\n        and our and their respective licensors and service providers, and our\n        and their respective officers, directors, employees, contractors,\n        agents, licensors, suppliers, successors, and assigns from and against\n        any claims, liabilities, damages, judgments, awards, losses, costs,\n        expenses, or fees (including reasonable attorneys&rsquo; fees and legal\n        costs) arising out of or relating to your violation of these Terms or\n        your use of the Platform (and/or Services), including, but not limited\n        to, your User Contributions and your use of any information obtained\n        from the Platform (and/or Services).\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.hx1r74d4jb3g\">\n      <span class=\"c7\">Intellectual Property Rights</span>\n    </h2>\n    <p class=\"c1\">\n      <span>\n        The Platform and their entire contents, features, and functionality\n        (including but not limited to all information, code, functionality,\n        software, text, displays, images, video, and audio, and the design,\n        selection, and arrangement thereof), may be protected by{\" \"}\n      </span>\n      <span>United States</span>\n      <span class=\"c0\">\n        &nbsp;and international copyright, trademark, patent, trade secret, and\n        other intellectual property or proprietary rights laws.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        These Terms permit you to access and use the Platform, and the materials\n        available through the same, for your personal, non-commercial use only.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span>\n        No right, title, or interest in or to the Platform or any content\n        available on it is transferred to you, and all rights not expressly\n        granted are reserved by us, or the applicable third-party owner or\n        licensor. Any use of the Platform not expressly permitted by these Terms\n        is a breach of these Terms and may violate copyright, trademark, and\n        other laws.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.u0y9jsf24vwn\">\n      <span class=\"c7\">Trademarks</span>\n    </h2>\n    <p class=\"c1\">\n      <span>\n        Company&rsquo;s name, the terms NEAR, NEAR Horizon, and all related\n        names, logos, product and service names, designs, and slogans are\n        trademarks of Company or its licensors. You must not use such marks\n        without our prior written permission. All other names, logos, product\n        and service names, designs, and slogans on the Platform (and/or\n        Services) are the trademarks of their respective owners.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.jzadb9wyfqk3\">\n      <span class=\"c7\">Changes to these Terms </span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        We may revise and update these Terms from time to time in our sole\n        discretion. All changes are effective immediately when we post them to\n        the Platform and apply to all access to and use of the Platform\n        thereafter. However, any changes to the dispute resolution provisions\n        set out in the Governing Law and Jurisdiction section below will not\n        apply to any disputes for which the parties have actual notice on or\n        before the date the change is posted.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        Your continued use of the Platform following the posting of revised\n        Terms means that you accept and agree to the changes.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.6xq3eqkp1rij\">\n      <span class=\"c7\">Governing Law and Jurisdiction</span>\n    </h2>\n    <p class=\"c1\">\n      <span>\n        All matters relating to the Platform and these Terms, and any dispute or\n        claim arising therefrom or related thereto (in each case, including\n        non-contractual disputes or claims), shall be governed by and construed\n        in accordance with the law of the{\" \"}\n      </span>\n      <span>Cayman Islands</span>\n      <span class=\"c0\">.</span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        Any legal suit, action, or proceeding arising out of, or related to,\n        Platform and these Terms shall be instituted exclusively in the courts\n        of the Cayman Islands, although we retain the right to bring any suit,\n        action, or proceeding against you for breach of these Terms in your\n        country of residence or any other relevant country.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        You waive any and all objections to the exercise of jurisdiction over\n        you by such courts and to venue in such courts.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.gbgwiumxbxbz\">\n      <span class=\"c7\">Limitation on Time to File Claims</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        ANY CAUSE OF ACTION OR CLAIM YOU MAY HAVE ARISING OUT OF OR RELATING TO\n        THESE TERMS OR THE PLATFORM MUST BE COMMENCED WITHIN ONE (1) YEAR AFTER\n        THE CAUSE OF ACTION ACCRUES, OTHERWISE, SUCH CAUSE OF ACTION OR CLAIM IS\n        PERMANENTLY BARRED.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.9hk8crv2cuh2\">\n      <span class=\"c7\">Waiver and Severability</span>\n    </h2>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        No waiver by us of any term or condition set out in these Terms shall be\n        deemed a further or continuing waiver of such term or condition or a\n        waiver of any other term or condition, and any failure of us to assert a\n        right or provision under these Terms shall not constitute a waiver of\n        such right or provision.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        If any provision of these Terms is held by a court or other tribunal of\n        competent jurisdiction to be invalid, illegal or unenforceable for any\n        reason, such provision shall be eliminated or limited to the minimum\n        extent such that the remaining provisions of the Terms will continue in\n        full force and effect.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.fejr57riwaa6\">\n      <span class=\"c7\">Entire Agreement</span>\n    </h2>\n    <p class=\"c1\">\n      <span>\n        The Terms (including any terms expressly referred to herein, to the\n        extent governing the relationship between you and Discovery Domain Ltd)\n        and the{\" \"}\n      </span>\n      <span class=\"c17\">\n        <a class=\"c24\" href=\"/privacy\">\n          Privacy Policy\n        </a>\n      </span>\n      <span>\n        &nbsp;constitute the sole and entire agreement between you and{\" \"}\n      </span>\n      <span>Discovery Domain Ltd</span>\n      <span class=\"c0\">\n        &nbsp;regarding the Platform and supersede all prior and contemporaneous\n        understandings, agreements, representations, and warranties, both\n        written and oral, regarding the Platform.\n      </span>\n    </p>\n    <h2 class=\"c4\" id=\"h.72nkn8gzuygn\">\n      <span class=\"c7\">Your Comments and Concerns</span>\n    </h2>\n    <p class=\"c1\">\n      <span>\n        All feedback, comments, questions, and other communications relating to\n        these Terms should be directed to:{\" \"}\n      </span>\n      <span class=\"c22\">horizon@near.foundation</span>\n    </p>\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <div>\n      <p class=\"c15\">\n        <span class=\"c18\"></span>\n      </p>\n    </div>\n  </div>\n);\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/nearhorizon.near/widget/TNCPage"}