{"tx_hash": "E81MnsDV4B2tJfRcuYMF2ZURY6WwxLxoufL4nahM3AUg", "action_id_social": "BhiWWSgsfCnTB9oN33BGecfMPT48j4E2Ncq2D8eTTfni-0-widget", "block_id": 86520703, "block_timestamp": "2023-03-04 07:01:24.395", "signer_id": "markeljan.near", "widget_name": "PostWithHistory", "source_code": null, "metadata": NaN, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/markeljan.near/widget/PostWithHistory", "metadata.description": "![historywidget](https://user-images.githubusercontent.com/12901349/222880515-ec4c0ed7-8bbc-4900-b788-853262262961.gif)\n\n# DevGigsBoard Editing History Widget\nThis widget allows users to view the editing history of posts on DevGigsBoard, a platform for developers to share their work and connect with potential clients. The editing history is stored on a smart contract and can be accessed through this widget.\n\n## Features\nDropdown menu with timestamps and accounts corresponding to when and who edited a webpage\nClicking a timestamp opens the webpage with the post the way it looked after that edit\nSelecting two timestamps opens a diff window that shows what parts of the post have changed between the two selected timestamps\n\n### To use the DevGigsBoard Editing History Widget, follow these steps:\n\nGo to https://near.social/#/markeljan.near/widget/PostWithHistory?id=164\nFind a post that you want to view the editing history for\nClick on the \"Editing History\" button located on the post card\nSelect the desired timestamp from the dropdown menu\nThe post will be displayed as it looked after that edit\nTo compare two timestamps, select the first timestamp from the dropdown menu, then hold down the Shift key and select the second timestamp\nA diff window will appear, showing what parts of the post have changed between the two selected timestamps\n\n## License\nThis widget is licensed under the MIT License.\n", "metadata.image.ipfs_cid": "bafybeifsinrmywyvmhn3adbgzrqfhh5c7sig6m5ntk7lynq22urkucmydi", "metadata.name": "devgovgigs-PostWithHistory", "metadata.tags.developer-governance": "", "metadata.tags.devgovgigs": "", "metadata.tags.ethdenver2023": "", "metadata.tags.hackathon": "", "metadata.tags.post": ""}